---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.Dispose
source: html/26b25286-2121-66e9-c4d0-563262ec5821.htm
---
# Autodesk.Revit.DB.FillGrid.Dispose Method

Releases all resources used by the FillGrid

## Syntax (C#)
```csharp
public void Dispose()
```